wiki/2016-09-06-计算字符串相似度算法——Levenshtein.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>计算字符串相似度算法——LEVENSHTEIN</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">计算字符串相似度算法——LEVENSHTEIN</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#reprint"><div class="category">reprint</div></a> </div>
<div class="char-counter">2016-09-06</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgeb7db30">0. 这个算法实现起来很简单</a></li>
<li><a href="#org437e586">1.百度百科介绍：</a></li>
<li><a href="#org08b5d5e">2.用途</a></li>
<li><a href="#org0e2b1a1">3.实现过程</a></li>
<li><a href="#org5e199ef">4.代码实现</a></li>
<li><a href="#org44a59d8">5.猜测原理</a></li>
<li><a href="#orga6e60b3">6. 结束</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgeb7db30" class="outline-2">
<h2 id="orgeb7db30">0. 这个算法实现起来很简单</h2>
</div>

<div id="outline-container-org437e586" class="outline-2">
<h2 id="org437e586">1.百度百科介绍：</h2>
<div class="outline-text-2" id="text-org437e586">
<p>
Levenshtein 距离，又称编辑距离，指的是两个字符串之间，由一个转换成另一个所需的最
少编辑操作次数。许可的编辑操作包括将一个字符替换成另一个字符，插入一个字符，删除
一个字符。 编辑距离的算法是首先由俄国科学家Levenshtein提出的，故又叫Levenshtein
Distance。
</p>
</div>
</div>

<div id="outline-container-org08b5d5e" class="outline-2">
<h2 id="org08b5d5e">2.用途</h2>
<div class="outline-text-2" id="text-org08b5d5e">
<p>
模糊查询
</p>
</div>
</div>

<div id="outline-container-org0e2b1a1" class="outline-2">
<h2 id="org0e2b1a1">3.实现过程</h2>
<div class="outline-text-2" id="text-org0e2b1a1">
<ol class="org-ol">
<li>首先是有两个字符串,这里写一个简单的 abc和 abe</li>

<li><p>
将字符串想象成下面的结构。
</p>

<p>
A处是一个标记，为了方便讲解，不是这个表的内容。
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left">abc</td>
<td class="org-right">a</td>
<td class="org-left">b</td>
<td class="org-right">c</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">abe</td>
<td class="org-right">0</td>
<td class="org-left">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-right">1</td>
<td class="org-left">A处</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-right">3</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table></li>
</ol>


<ol class="org-ol">
<li><p>
来计算A处出得值
它的值取决于：左边的1、上边的1、左上角的0.
按照Levenshtein distance的意思：
上面的值和左面的值都要求加1，这样得到1+1=2。
</p>

<p>
A处由于是两个a相同，左上角的值加0.这样得到0+0=0。
</p>

<p>
这是后有三个值，左边的计算后为2，上边的计算后为2，左上角的计算为0，所以A处 取
他们里面最小的0.
</p></li>

<li><p>
于是表成为下面的样子
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left">abc</td>
<td class="org-right">a</td>
<td class="org-left">b</td>
<td class="org-right">c</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">abe</td>
<td class="org-right">0</td>
<td class="org-left">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-right">1</td>
<td class="org-left">0</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-right">2</td>
<td class="org-left">B处</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-right">3</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
在B处 会同样得到三个值，左边计算后为3，上边计算后为1，在B处 由于对应的字符为a、
b，不相等，所以左上角应该在当前值的基础上加1，这样得到1+1=2，在（3,1,2）中选
出最小的为B处的值。
</p></li>

<li><p>
于是表就更新了
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left">abc</td>
<td class="org-right">a</td>
<td class="org-right">b</td>
<td class="org-right">c</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">abe</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-right">3</td>
<td class="org-right">C处</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
C处 计算后：上面的值为2，左边的值为4，左上角的：a和e不相同，所以加1，即2+1，
左上角的为3。
</p>

<p>
在（2,4,3）中取最小的为C处  的值。
</p>

<ol class="org-ol">
<li><p>
于是依次推得到
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">a</td>
<td class="org-right">b</td>
<td class="org-left">c</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">0</td>
<td class="org-right">1</td>
<td class="org-left">2</td>
<td class="org-left">3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-right">1</td>
<td class="org-left">A处0</td>
<td class="org-left">D处1</td>
<td class="org-left">G处2</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-right">2</td>
<td class="org-left">B处1</td>
<td class="org-left">E处0</td>
<td class="org-left">H处1</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-right">3</td>
<td class="org-left">C处2</td>
<td class="org-left">F处1</td>
<td class="org-left">I处1</td>
</tr>
</tbody>
</table>

<p>
I处:  表示abc 和abe 有1个需要编辑的操作。这个是需要计算出来的。
</p>

<p>
同时，也获得一些额外的信息。
</p>
<p class="verse">
A处:  表示a      和a      需要有0个操作。字符串一样<br>
B处:  表示ab    和a      需要有1个操作。<br>
C处:  表示abe  和a      需要有2个操作。<br>
D处:  表示a      和ab    需要有1个操作。<br>
E处:  表示ab    和ab    需要有0个操作。字符串一样<br>
F处:  表示abe  和ab    需要有1个操作。<br>
G处:  表示a      和abc   需要有2个操作。<br>
H处:  表示ab    和abc    需要有1个操作。<br>
I处:  表示abe   和abc    需要有1个操作。<br>
<br>
</p></li>
</ol></li>

<li><p>
计算相似度
</p>

<p>
先取两个字符串长度的最大值maxLen，用1-（需要操作数除maxLen），得到相似度。
</p>

<p>
例如abc 和abe 一个操作，长度为3，所以相似度为1-1/3=0.666。
</p></li>
</ol>
</div>
</div>



<div id="outline-container-org5e199ef" class="outline-2">
<h2 id="org5e199ef">4.代码实现</h2>
<div class="outline-text-2" id="text-org5e199ef">
<p>
直接能运行， 复制过去就行。
</p>
<div class="org-src-container">
<pre class="src src-java">
<span style="font-weight: bold;">package</span> <span style="font-weight: bold; text-decoration: underline;">code</span>;

<span style="font-style: italic;">/**</span>
<span style="font-style: italic;"> * </span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">@class</span><span style="font-style: italic;">Name:MyLevenshtein.java</span>
<span style="font-style: italic;"> * </span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">@class</span><span style="font-style: italic;">Description:Levenshtein Distance &#31639;&#27861;&#23454;&#29616;</span>
<span style="font-style: italic;"> * &#21487;&#20197;&#20351;&#29992;&#30340;&#22320;&#26041;&#65306;DNA&#20998;&#26512; &#12288;&#12288;&#25340;&#23383;&#26816;&#26597; &#12288;&#12288;&#35821;&#38899;&#36776;&#35782; &#12288;&#12288;&#25220;&#34989;&#20390;&#27979;</span>
<span style="font-style: italic;"> * </span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">@author</span><span style="font-style: italic;">:donghai.wan</span>
<span style="font-style: italic;"> * </span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">@create</span><span style="font-style: italic;">Time:2012-1-12</span>
<span style="font-style: italic;"> */</span>
<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">MyLevenshtein</span> {

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>) {
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35201;&#27604;&#36739;&#30340;&#20004;&#20010;&#23383;&#31526;&#20018;</span>
        <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">str1</span> = <span style="font-style: italic;">"&#20170;&#22825;&#26143;&#26399;&#22235;"</span>;
        <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">str2</span> = <span style="font-style: italic;">"&#20170;&#22825;&#26159;&#26143;&#26399;&#20116;"</span>;
        levenshtein(str1,str2);
    }

    <span style="font-style: italic;">/**</span>
<span style="font-style: italic;">     * &#12288;&#12288;DNA&#20998;&#26512; &#12288;&#12288;&#25340;&#23383;&#26816;&#26597; &#12288;&#12288;&#35821;&#38899;&#36776;&#35782; &#12288;&#12288;&#25220;&#34989;&#20390;&#27979;</span>
<span style="font-style: italic;">     *</span>
<span style="font-style: italic;">     * </span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">@create</span><span style="font-style: italic;">Time 2012-1-12</span>
<span style="font-style: italic;">     */</span>
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">levenshtein</span>(<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">str1</span>,<span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">str2</span>) {
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35745;&#31639;&#20004;&#20010;&#23383;&#31526;&#20018;&#30340;&#38271;&#24230;&#12290;</span>
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">len1</span> = str1.length();
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">len2</span> = str2.length();
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#24314;&#31435;&#19978;&#38754;&#35828;&#30340;&#25968;&#32452;&#65292;&#27604;&#23383;&#31526;&#38271;&#24230;&#22823;&#19968;&#20010;&#31354;&#38388;</span>
        <span style="font-weight: bold; text-decoration: underline;">int</span>[][] <span style="font-weight: bold; font-style: italic;">dif</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">int</span>[len1 + 1][len2 + 1];
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#36171;&#21021;&#20540;&#65292;&#27493;&#39588;B&#12290;</span>
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span> = 0; a &lt;= len1; a++) {
            dif[a][0] = a;
        }
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span> = 0; a &lt;= len2; a++) {
            dif[0][a] = a;
        }
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35745;&#31639;&#20004;&#20010;&#23383;&#31526;&#26159;&#21542;&#19968;&#26679;&#65292;&#35745;&#31639;&#24038;&#19978;&#30340;&#20540;</span>
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">temp</span>;
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 1; i &lt;= len1; i++) {
            <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">j</span> = 1; j &lt;= len2; j++) {
                <span style="font-weight: bold;">if</span> (str1.charAt(i - 1) == str2.charAt(j - 1)) {
                    temp = 0;
                } <span style="font-weight: bold;">else</span> {
                    temp = 1;
                }
                <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#21462;&#19977;&#20010;&#20540;&#20013;&#26368;&#23567;&#30340;</span>
                dif[i][j] = min(dif[i - 1][j - 1] + temp, dif[i][j - 1] + 1,
                        dif[i - 1][j] + 1);
            }
        }
        System.out.println(<span style="font-style: italic;">"&#23383;&#31526;&#20018;\""</span>+str1+<span style="font-style: italic;">"\"&#19982;\""</span>+str2+<span style="font-style: italic;">"\"&#30340;&#27604;&#36739;"</span>);
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#21462;&#25968;&#32452;&#21491;&#19979;&#35282;&#30340;&#20540;&#65292;&#21516;&#26679;&#19981;&#21516;&#20301;&#32622;&#20195;&#34920;&#19981;&#21516;&#23383;&#31526;&#20018;&#30340;&#27604;&#36739;</span>
        System.out.println(<span style="font-style: italic;">"&#24046;&#24322;&#27493;&#39588;&#65306;"</span>+dif[len1][len2]);
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#35745;&#31639;&#30456;&#20284;&#24230;</span>
        <span style="font-weight: bold; text-decoration: underline;">float</span> <span style="font-weight: bold; font-style: italic;">similarity</span> =1 - (<span style="font-weight: bold; text-decoration: underline;">float</span>) dif[len1][len2] / Math.max(str1.length(), str2.length());
        System.out.println(<span style="font-style: italic;">"&#30456;&#20284;&#24230;&#65306;"</span>+similarity);
    }

    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">&#24471;&#21040;&#26368;&#23567;&#20540;</span>
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">min</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>... <span style="font-weight: bold; font-style: italic;">is</span>) {
        <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">min</span> = <span style="font-weight: bold; text-decoration: underline;">Integer</span>.MAX_VALUE;
        <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> : is) {
            <span style="font-weight: bold;">if</span> (min &gt; i) {
                min = i;
            }
        }
        <span style="font-weight: bold;">return</span> min;
    }

}

</pre>
</div>
</div>
</div>



<div id="outline-container-org44a59d8" class="outline-2">
<h2 id="org44a59d8">5.猜测原理</h2>
<div class="outline-text-2" id="text-org44a59d8">
<p>
为什么这样就能算出相似度了？
</p>

<p>
首先在连续相等的字符就可以考虑到
</p>

<p>
红色是取值的顺序。
</p>

<ol class="org-ol">
<li><p>
今天周一    天周一
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left">天</td>
<td class="org-right">周</td>
<td class="org-right">一</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">0</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">今</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">天</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">周</td>
<td class="org-right">3</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">一</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
实现是去掉“今”，一步完成。
</p></li>

<li><p>
听说马上就要放假了 你听说要放假了
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">你</td>
<td class="org-right">听</td>
<td class="org-right">说</td>
<td class="org-right">要</td>
<td class="org-right">放</td>
<td class="org-right">假</td>
<td class="org-right">了</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-left">听</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">说</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">马</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">上</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">就</td>
<td class="org-right">5</td>
<td class="org-right">5</td>
<td class="org-right">5</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">要</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">5</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-right">5</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">放</td>
<td class="org-right">7</td>
<td class="org-right">7</td>
<td class="org-right">7</td>
<td class="org-right">6</td>
<td class="org-right">5</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">假</td>
<td class="org-right">8</td>
<td class="org-right">8</td>
<td class="org-right">8</td>
<td class="org-right">7</td>
<td class="org-right">6</td>
<td class="org-right">5</td>
<td class="org-right">4</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">了</td>
<td class="org-right">9</td>
<td class="org-right">9</td>
<td class="org-right">9</td>
<td class="org-right">8</td>
<td class="org-right">7</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
<td class="org-right">4</td>
</tr>
</tbody>
</table>

<p>
这两个字符串是：
</p>

<p>
去掉“你”，加上“马上就”，总共四步操作。
</p></li>

<li>还是没弄懂</li>
</ol>
</div>
</div>

<div id="outline-container-orga6e60b3" class="outline-2">
<h2 id="orga6e60b3">6. 结束</h2>
<div class="outline-text-2" id="text-orga6e60b3">
<p>
算法优化空间很大。
</p>

<p>
最后也没弄懂为什么这样算能算出相似度。
</p>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
